       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONTABAN.
       AUTHOR. VITOR SETRAGNI.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQ-CONTA ASSIGN TO UT-S-ENTRADA.
           SELECT ARQ-RELAT ASSIGN TO UT-S-RELATO.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQ-CONTA
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 54 CHARACTERS
           DATA RECORD IS REG-CONTA.
           COPY REGCONTA.

       FD  ARQ-RELAT
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 120 CHARACTERS
           DATA RECORD IS REG-RELAT.
       01  REG-RELAT PIC X(120).

       WORKING-STORAGE SECTION.
       01  FIM-ARQUIVO PIC X(01) VALUE 'N'.
       01  CONTA-VALIDA PIC X(01) VALUE 'S'.
       01  TIPO-DESCRICAO PIC X(10) VALUE SPACES.
       01  STATUS-CONTA PIC X(12) VALUE SPACES.

       01  TOTAL-CONTAS-LIDAS PIC 9(05) VALUE ZERO.
       01  TOTAL-CONTAS-VALIDAS PIC 9(05) VALUE ZERO.
       01  TOTAL-CONTAS-INVALIDAS PIC 9(05) VALUE ZERO.
       01  SALDO-TOTAL-GERAL PIC 9(13)V99 VALUE ZERO.

       01  LINHA-TITULO PIC X(120) VALUE
           'RELATORIO DE CONTAS BANCARIAS'.
       01  LINHA-SEPARACAO PIC X(120) VALUE ALL '-'.

       01  DETALHE-RELATORIO.
           05  FILLER PIC X(07) VALUE 'CONTA: '.
           05  DET-CONTA PIC 9(08).
           05  FILLER PIC X(08) VALUE ' NOME: '.
           05  DET-NOME PIC X(30).
           05  FILLER PIC X(05) VALUE ' AG: '.
           05  DET-AGENCIA PIC 9(04).
           05  FILLER PIC X(07) VALUE ' TIPO: '.
           05  DET-TIPO PIC X(10).
           05  FILLER PIC X(08) VALUE ' SALDO: '.
           05  DET-SALDO PIC ZZZZZZZZ9.99.
           05  FILLER PIC X(09) VALUE ' STATUS: '.
           05  DET-STATUS PIC X(12).
           05  FILLER PIC X(14) VALUE SPACES.

       01  LINHA-TOTAL-LIDAS.
           05  FILLER PIC X(22) VALUE 'TOTAL LIDAS.......: '.
           05  RES-LIDAS PIC ZZZZ9.
           05  FILLER PIC X(93) VALUE SPACES.
       01  LINHA-TOTAL-VALIDAS.
           05  FILLER PIC X(22) VALUE 'TOTAL VALIDAS.....: '.
           05  RES-VALIDAS PIC ZZZZ9.
           05  FILLER PIC X(93) VALUE SPACES.
       01  LINHA-TOTAL-INVALIDAS.
           05  FILLER PIC X(22) VALUE 'TOTAL INVALIDAS...: '.
           05  RES-INVALIDAS PIC ZZZZ9.
           05  FILLER PIC X(93) VALUE SPACES.
       01  LINHA-TOTAL-SALDO.
           05  FILLER PIC X(22) VALUE 'SALDO TOTAL.......: '.
           05  RES-SALDO PIC ZZZZZZZZZZZZ9.99.
           05  FILLER PIC X(82) VALUE SPACES.

       PROCEDURE DIVISION.
       0000-PRINCIPAL.
           OPEN INPUT ARQ-CONTA.
           OPEN OUTPUT ARQ-RELAT.
           MOVE LINHA-TITULO TO REG-RELAT.
           PERFORM 0800-GRAVA-LINHA.
           MOVE LINHA-SEPARACAO TO REG-RELAT.
           PERFORM 0800-GRAVA-LINHA.
           PERFORM 0100-LER-CONTA.
           PERFORM 0200-PROCESSAR
           UNTIL FIM-ARQUIVO = 'S'.
           PERFORM 0900-FINALIZAR.
           CLOSE ARQ-CONTA ARQ-RELAT.
           STOP RUN.

       0100-LER-CONTA.
           READ ARQ-CONTA
           AT END MOVE 'S' TO FIM-ARQUIVO.

       0200-PROCESSAR.
           ADD 1 TO TOTAL-CONTAS-LIDAS.
           MOVE 'N' TO CONTA-VALIDA.
           MOVE 'TIPO INV.' TO STATUS-CONTA.
           MOVE 'INVALIDO' TO TIPO-DESCRICAO.
           IF TIPO-CONTA = 'C'
           MOVE 'S' TO CONTA-VALIDA
           MOVE 'VALIDA' TO STATUS-CONTA
           MOVE 'CORRENTE' TO TIPO-DESCRICAO.
           IF TIPO-CONTA = 'P'
           MOVE 'S' TO CONTA-VALIDA
           MOVE 'VALIDA' TO STATUS-CONTA
           MOVE 'POUPANCA' TO TIPO-DESCRICAO.
           IF CONTA-VALIDA = 'S'
           ADD 1 TO TOTAL-CONTAS-VALIDAS
           ADD SALDO TO SALDO-TOTAL-GERAL.
           IF CONTA-VALIDA = 'N'
           ADD 1 TO TOTAL-CONTAS-INVALIDAS.
           PERFORM 0300-MOSTRAR-CONTA.
           PERFORM 0100-LER-CONTA.

       0300-MOSTRAR-CONTA.
           MOVE NUM-CONTA TO DET-CONTA.
           MOVE NOME-CLIENTE TO DET-NOME.
           MOVE AGENCIA TO DET-AGENCIA.
           MOVE TIPO-DESCRICAO TO DET-TIPO.
           MOVE SALDO TO DET-SALDO.
           MOVE STATUS-CONTA TO DET-STATUS.
           MOVE DETALHE-RELATORIO TO REG-RELAT.
           PERFORM 0800-GRAVA-LINHA.

       0800-GRAVA-LINHA.
           DISPLAY REG-RELAT.
           WRITE REG-RELAT.

       0900-FINALIZAR.
           MOVE LINHA-SEPARACAO TO REG-RELAT.
           PERFORM 0800-GRAVA-LINHA.
           MOVE TOTAL-CONTAS-LIDAS TO RES-LIDAS.
           MOVE LINHA-TOTAL-LIDAS TO REG-RELAT.
           PERFORM 0800-GRAVA-LINHA.
           MOVE TOTAL-CONTAS-VALIDAS TO RES-VALIDAS.
           MOVE LINHA-TOTAL-VALIDAS TO REG-RELAT.
           PERFORM 0800-GRAVA-LINHA.
           MOVE TOTAL-CONTAS-INVALIDAS TO RES-INVALIDAS.
           MOVE LINHA-TOTAL-INVALIDAS TO REG-RELAT.
           PERFORM 0800-GRAVA-LINHA.
           MOVE SALDO-TOTAL-GERAL TO RES-SALDO.
           MOVE LINHA-TOTAL-SALDO TO REG-RELAT.
           PERFORM 0800-GRAVA-LINHA.
